In [1]:
import pandas as pd
import numpy as np

In [2]:
dict_data = {'제품ID':['P501', 'P502', 'P503', 'P504', 'P505', 'P506', 'P507'],
            '판매가격':[6400, 5400, 9400, 10400, 9800, 1200, 3400],
            '판매랑':[63, 56, 98, 48, 72, 59, 43],
            '이익률':[0.30, 0.21, 0.15, 0.25, 0.45, 0.47, 0.32]}

df2 = pd.DataFrame(dict_data)

In [3]:
df2

   제품ID   판매가격  판매랑   이익률
0  P501   6400   63  0.30
1  P502   5400   56  0.21
2  P503   9400   98  0.15
3  P504  10400   48  0.25
4  P505   9800   72  0.45
5  P506   1200   59  0.47
6  P507   3400   43  0.32

In [4]:
df2.head()   # 처음 5개의 행 데이터 선택

   제품ID   판매가격  판매랑   이익률
0  P501   6400   63  0.30
1  P502   5400   56  0.21
2  P503   9400   98  0.15
3  P504  10400   48  0.25
4  P505   9800   72  0.45

In [6]:
df2.head(2) # 처음 2개의 행 데이터 선택

   제품ID  판매가격  판매랑   이익률
0  P501  6400   63  0.30
1  P502  5400   56  0.21

In [10]:
df2.tail() # 마지막 5개의 행 데이터 선택

   제품ID   판매가격  판매랑   이익률
2  P503   9400   98  0.15
3  P504  10400   48  0.25
4  P505   9800   72  0.45
5  P506   1200   59  0.47
6  P507   3400   43  0.32

In [11]:
df2.tail(2)

   제품ID  판매가격  판매랑   이익률
5  P506  1200   59  0.47
6  P507  3400   43  0.32

### 열 데이터 선택

In [12]:
df2['제품ID']

0    P501
1    P502
2    P503
3    P504
4    P505
5    P506
6    P507
Name: 제품ID, dtype: object

In [13]:
df2[['제품ID']]  # 하나의 열 데이터라도 DataFrame 형식으로 반환하려면 다음과 같이 열 이름을 리스트 형식으로 지정

   제품ID
0  P501
1  P502
2  P503
3  P504
4  P505
5  P506
6  P507

In [14]:
df2[['제품ID', '이익률', '판매가격']]

   제품ID   이익률   판매가격
0  P501  0.30   6400
1  P502  0.21   5400
2  P503  0.15   9400
3  P504  0.25  10400
4  P505  0.45   9800
5  P506  0.47   1200
6  P507  0.32   3400

In [15]:
df2['이익률'] = 0.5
df2

   제품ID   판매가격  판매랑  이익률
0  P501   6400   63  0.5
1  P502   5400   56  0.5
2  P503   9400   98  0.5
3  P504  10400   48  0.5
4  P505   9800   72  0.5
5  P506   1200   59  0.5
6  P507   3400   43  0.5

### 행과 열 데이터 선택

행과 열을 선택할때
>**DataFrame_data.loc[index_label_item, columns_name_item]**  
>**DataFrame_data.iloc[index_pos_item, columns_pos_item]**

행과 열을 바꿀때
>**DataFrame_data.T**

In [16]:
dict_data = {'A':[0, 1, 2, 3, 4],
            'B':[10, 11, 12, 13, 14],
            'C':[20, 21, 22, 23, 24]}
index_data = ['a', 'b', 'c', 'd', 'e']

df = pd.DataFrame(dict_data, index=index_data)
df

   A   B   C
a  0  10  20
b  1  11  21
c  2  12  22
d  3  13  23
e  4  14  24

In [17]:
df.loc['a', 'A'] # loc 이용

0

In [19]:
df.iloc[0, 0] # iloc 이용

0

In [21]:
df.loc['a':'c', ['A', 'B']] # loc 이용

   A   B
a  0  10
b  1  11
c  2  12

In [22]:
df.iloc[0:3, 0:2] # iloc 이용

   A   B
a  0  10
b  1  11
c  2  12

In [23]:
df.loc[df['A']>2, ['A', 'B']] # loc 이용

   A   B
d  3  13
e  4  14

In [25]:
df.loc['a':'c', ['A', 'B']] = 50
df

    A   B   C
a  50  50  20
b  50  50  21
c  50  50  22
d   3  13  23
e   4  14  24

In [27]:
df.iloc[3:5, 1:3] = 100
df

    A    B    C
a  50   50   20
b  50   50   21
c  50   50   22
d   3  100  100
e   4  100  100

In [28]:
df.loc[df['B']<70, 'B'] = 70
df

    A    B    C
a  50   70   20
b  50   70   21
c  50   70   22
d   3  100  100
e   4  100  100

In [30]:
df.loc[df['C']<30, 'D'] = 40 # loc 이용, 스칼라 값 지정
df

    A    B    C     D
a  50   70   20  40.0
b  50   70   21  40.0
c  50   70   22  40.0
d   3  100  100   NaN
e   4  100  100   NaN

In [36]:
df['C']['c']  #--> 22
df['C'][2]    #--> 22
df['C'][[0,1,3]]

a     20
b     21
d    100
Name: C, dtype: int64

In [37]:
df['C']['a':'d']

a     20
b     21
c     22
d    100
Name: C, dtype: int64

In [38]:
df['C'][df['B']>=5]

a     20
b     21
c     22
d    100
e    100
Name: C, dtype: int64

In [40]:
df

    A    B    C     D
a  50   70   20  40.0
b  50   70   21  40.0
c  50   70   22  40.0
d   3  100  100   NaN
e   4  100  100   NaN

In [41]:
df.T

      a     b     c      d      e
A  50.0  50.0  50.0    3.0    4.0
B  70.0  70.0  70.0  100.0  100.0
C  20.0  21.0  22.0  100.0  100.0
D  40.0  40.0  40.0    NaN    NaN

### 행이나 열 데이터 삭제  

>**Series_data.drop(index = index_label)**  
>**DataFrame_data.drop(index = index_label 혹은 columns = column_name)**

In [42]:
import numpy as np
import pandas as pd

In [44]:
s3 = pd.Series([10, 20, 30, 40, np.nan, 60])
s3

0    10.0
1    20.0
2    30.0
3    40.0
4     NaN
5    60.0
dtype: float64

In [46]:
s3.drop(index = 0)  # Series epdlxjdptj gkskdml goddmf wprj

1    20.0
2    30.0
3    40.0
4     NaN
5    60.0
dtype: float64

In [47]:
s3.drop(index = [1, 3, 5])

0    10.0
2    30.0
4     NaN
dtype: float64